/*
 Localized strings for CFErrors returned by AVFoundationCF.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationCFErrorDomain_AVCFErrorOutOfMemory_Description" = "לא ניתן להשלים את הפעולה";
"AVFoundationCFErrorDomain_AVCFErrorOutOfMemory_RecoverySuggestion" = "נסה/י שוב מאוחר יותר.";

"AVFoundationCFErrorDomain_AVCFErrorFileFormatNotRecognized_Description" = "לא ניתן לפתוח";
"AVFoundationCFErrorDomain_AVCFErrorFileFormatNotRecognized_FailureReason" = "מבנה מדיה זה אינו נתמך.";
"AVFoundationCFErrorDomain_AVCFErrorFileFailedToParse_Description" = "לא ניתן לפתוח";
"AVFoundationCFErrorDomain_AVCFErrorFileFailedToParse_FailureReason" = "יתכן שמדיה זו פגומה.";

"AVFoundationCFErrorDomain_AVCFErrorContentIsProtected_Description" = "לא ניתן לפתוח";
"AVFoundationCFErrorDomain_AVCFErrorContentIsProtected_FailureReason" = "יישום זה אינו מורשה להפעיל קובץ זה."; /* the file is DRM protected */
"AVFoundationCFErrorDomain_AVCFErrorNoImageAtTime_Description" = "לא ניתן לפתוח";
"AVFoundationCFErrorDomain_AVCFErrorNoImageAtTime_FailureReason" = "לא ניתן להשתמש במדיה זו.";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_Description" = "לא ניתן לפענח את הקידוד";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_FailureReason" = "מפענח הקידוד הדרוש עבור מדיה זו עמוס.";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "עצור/י כל פעולה אחרת המפענחת קידוד של מדיה ונסה/י שוב.";
"AVFoundationCFErrorDomain_AVCFErrorIncompatibleAsset_Description" = "לא ניתן לפתוח";
"AVFoundationCFErrorDomain_AVCFErrorIncompatibleAsset_FailureReason" = "לא ניתן להשתמש במדיה במחשב זה.";
"AVFoundationCFErrorDomain_AVCFErrorNoCompatibleAlternatesForExternalDisplay_Description" = "הפתיחה נכשלה";
"AVFoundationCFErrorDomain_AVCFErrorNoCompatibleAlternatesForExternalDisplay_FailureReason" = "לא ניתן להפעיל תוכן זה בצג החיצוני.";
"AVFoundationCFErrorDomain_AVCFErrorInsufficientContentProtectionConfiguration_Description" = "הפתיחה נכשלה";
"AVFoundationCFErrorDomain_AVCFErrorInsufficientContentProtectionConfiguration_FailureReason" = "לא ניתן להפעיל את התוכן המוגן בתצורת המערכת הנוכחית.";
"AVFoundationCFErrorDomain_AVCFErrorTranscodeFrameMismatch_Description" = "רצועת הווידאו שהתקבלה מממיר הקידוד מכילה מספר פריימים שגוי";
"AVFoundationCFErrorDomain_AVCFErrorTranscodeFrameMismatch_FailureReason" = "מספר הפריימים שהתקבל לאחר ההמרה שונה מהמספר במקור, שאינו מכיל קטעים לעריכה";
"AVFoundationCFErrorDomain_AVCFErrorDecodeFailed_Description" = "תקלה בפיענוח הקידוד";
"AVFoundationCFErrorDomain_AVCFErrorDecodeFailed_FailureReason" = "מפענח הקידוד נתקל בשגיאה";
"AVFoundationCFErrorDomain_AVCFErrorEncodeFailed_Description" = "תקלה במהלך הקידוד";
"AVFoundationCFErrorDomain_AVCFErrorEncodeFailed_FailureReason" = "המקודד נתקל בשגיאה";
"AVFoundationCFErrorDomain_AVCFErrorInvalidPersistentKey_Description" = "המפתח הלא מקוון שסופק אינו תקין";
"AVFoundationCFErrorDomain_AVCFErrorInvalidPersistentKey_FailureReason" = "ייתכן שהמפתח הלא מקוון שסופק אינו תקין, או שספריית האחסון הקבועה של המפתח לא נמצאה";
"AVFoundationCFErrorDomain_AVCFErrorContentIsNotAuthorized_Description" = "לא ניתן לפתוח";
"AVFoundationCFErrorDomain_AVCFErrorContentIsNotAuthorized_FailureReason" = "למחשב זה אין הרשאה להפעיל את התוכן";
"AVFoundationCFErrorDomain_AVCFErrorApplicationIsNotAuthorized_Description" = "לא ניתן לפתוח";
"AVFoundationCFErrorDomain_AVCFErrorApplicationIsNotAuthorized_FailureReason" = "ליישום זה אין הרשאה להפעיל תוכן מוגן";
"AVFoundationCFErrorDomain_AVCFErrorContentIsUnavailable_Description" = "לא ניתן לפתוח";
"AVFoundationCFErrorDomain_AVCFErrorContentIsUnavailable_FailureReason" = "תוכן זה אינו זמין עוד";
